Repository: idlesign/django-oauthost
Catalog: oauthost/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Access Restricted
ru: Доступ ограничен

source: Error
ru: Ошибка

source: OAuth 2.0 requires secure connection.
ru: OAuth 2.0 требует шифрованного подключения

source: Client ID must be supplied.
ru: ID клиента должен быть указан.

source: Invalid client ID is supplied.
ru: Указан неверный ID клиента.

source: Redirect URI should be supplied for a given client.
ru: Для этого клиента должен быть указан URI перенаправления.

source: Redirection URI supplied is not associated with given client.
ru: URI перенаправления не связан с указанным клиентом.

source: Authorization Request
ru: Запрос авторизации

source: Enabled
ru: Доступна

source: Disabled
ru: Недоступна

source: Scope ID
ru: ID области

source: Scope identifier. Usually in form of `app_name:view_name`.
ru: Идентификатор области. Обычно в виде `имя_приложения:имя_представления`.

source: Scope title
ru: Название области

source: Scope human-friendly name.
ru: Человекопонятное имя области.

source: Status
ru: Статус

source: Scope
ru: Область

source: Scopes
ru: Области

source: Confidential
ru: Доверенный

source: Public
ru: Публичный

source: Registered at
ru: Дата регистрации

source: Title
ru: Название

source: Registrant
ru: Зарегистрировавший

source: User who registered this client.
ru: Пользователь, зарегистрировавший клиента.

source: Description
ru: Описание

source: Application webpage URL.
ru: URL страницы приложения.

source: Identifier
ru: Идентификтаор

source: Public client identifier. <i>Generated automatically if empty.</i>.
ru: Публичный идентификатор клиента. <i>Сгенерируется автоматически, если оставить поле пустым.</i>.

source: Token lifetime
ru: Время жизни токена

source: Time in seconds after which token given to the application expires.
ru: Время в секундах, после которого токен, выданный приложению будет просрочен.

source: Password
ru: Пароль

source: Secret that can be used along with an identifier as username to authenticate with HTTP Basic scheme.
ru: Секретная строка, которая, вкупе с идентификатором, может использоваться для авторизации методом HTTP Basic.

source: Type
ru: Тип

source: <b>Confidential</b> &#8212; Clients capable of maintaining the confidentiality of their credentials, or capable of secure client authentication using other means.<br /> <b>Public</b> &#8212; Clients incapable of maintaining the confidentiality of their credentials, and incapable of secure client authentication via any other means
ru: <b>Доверенные</b> &#8212; клиенты, способные хранить конфиденциальность данных авторизации, либо способные безопасно авторизовать клиента, используя другие средства.<br /> <b>Публичные</b> &#8212; Клиенты, неспособные ни хранить конфиденциальность данных авторизации, ни безопасно авторизовать клиента, используя другие средства

source: The scopes client is restricted to. <i>All registered scopes will be available for the client if none selected.</i>
ru: Области, которым ограничен клиент. <i>Если не выбраны, клиенту станут доступны все зарегистрированные области.</i>

source: Supports # in "Location"
ru: Поддерживает # в "Location"

source: Should be checked if this client supports fragment component (#) in the HTTP "Location" response header field
ru: Следует выбрать, если клиент поддерживает фрагмент (#) в HTTP заголовке "Location" ответов

source: Client
ru: Клиент

source: Clients
ru: Клиенты

source: URI or URI scheme for authorization server to redirect client when an interaction with a resource owner is complete.
ru: URI, либо схема URI, по которой сервер перенаправит клиента, после завершения процедуры авторизации.

source: Redirection Endpoint
ru: Перенаправление

source: Redirection Endpoints
ru: Перенаправления

source: Issued at
ru: Дата выдачи

source: Code
ru: Код

source: Code issued upon authorization.
ru: Код, выданный при авторизации.

source: User
ru: Пользователь

source: The user authorization is granted for.
ru: Пользователь, которому выдан допуск.

source: The client authorization is granted for.
ru: Клиент, которому выдан допуск.

source: Redirect URI
ru: URI перенаправления

source: The URI authorization is bound to.
ru: URI, к которому привязана авторизация.

source: The scopes token issued with this code should be restricted to.
ru: Области, которыми дол быть оганичен токен, выдаваемый по данному коду.

source: Authorization code
ru: Код авторизации

source: Authorization codes
ru: Коды авторизации

source: Expires at
ru: Дата истечения

source: Access Token
ru: Токен доступа

source: Token to be used to access resources.
ru: Токен для доступа к ресурсам.

source: Refresh Token
ru: Токен обновления

source: Token to be used to refresh access token.
ru: Токен для обновления токена доступа.

source: Access token type client uses to apply the appropriate authorization method.
ru: Тип токена доступа, используемый клиентом для выбора нужного метода авторизации.

source: The user token is issued for.
ru: Пользователь, которому выдан токен.

source: The client application token is issued for.
ru: Клиент, которому выдан токен.

source: Authorization code used to generate this token.
ru: Код авторизации, использованный для создания этого токена.

source: The scopes token is restricted to.
ru: Области, для которых действует токен.

source: Token
ru: Токен

source: Tokens
ru: Токены

source: application asks you to grant it an access to:
ru: приложение просит вас дать досутп к:

source: Yes, authorize it
ru: Да, подтверждаю

source: No, I do not agree
ru: Нет, отказываю

source: To return to the application please push the button below.
ru: Для возврата в приложение нажмите на кнопку, расположенную ниже.

source: Return
ru: Вернуться

source: Sorry, but you have insufficient privileges to access this resource.
ru: Извините, но ваших привилегий недостаточно для доступа к этому ресурсу.

source: Access to this resource is restricted. Please provide appropriate credentials within the request to proceed.
ru: Доступ к этому ресурсу ограничен. Для работы с ним, пожалуйста, снабдите ваш запрос данными авторизации.
